app/views/tweets/index.html.erb

    <% if tweet.favorited_by?(current_user) %>
        <p><span>お気に入り解除: </span><%=link_to tweet.favorites.count, tweet_favorites_path(tweet.id), method: :delete %></p>
    <% else %>
        <p><span>お気に入り登録: </span><%=link_to tweet.favorites.count, tweet_favorites_path(tweet.id), method: :post %></p>
---
SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`tweet_id` = 1

  <% else %>
    <p><span>お気に入り数: </span><%= tweet.favorites.count %></p>
---
SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`tweet_id` = 1