app/controllers/tweets_controller.rb

  def create
    @tweet = Tweet.new(tweet_params)
    @tweet.user_id = current_user.id
    @tweet.save
---
INSERT INTO `tweets` (`body`, `user_id`, `created_at`, `updated_at`) VALUES ('やっほ～', 1, '2022-04-29 08:34:24.467380', '2022-04-29 08:34:24.467380')